const difference = require('./difference');

test('Функция difference должна вернуть разницу между массивами ([1,2,3,5], [3,5]), которая равна [1,2]', () => {
  expect(difference([1,2,3,5], [3,5])).toStrictEqual([1,2]);
});

test('Функция difference должна вернуть разницу между массивами ([1,2,3,5,6], [6,3,5]), которая равна [1,2]', () => {
  expect(difference([1,2,3,5,6], [6,3,5])).toStrictEqual([1,2]);
});

test('Функция difference должна вернуть разницу между массивами ([1,2,3,5,6], [1]), которая равна [2, 3, 4, 5, 6]', () => {
  expect(difference([1,2,3,5,6], [1])).toStrictEqual([2, 3, 5, 6]);
});

test('Функция difference должна вернуть разницу между массивами ([1,2,3,5,6], [7]), которая равна [1, 2, 3, 5, 6]', () => {
  expect(difference([1,2,3,5,6], [7])).toStrictEqual([1, 2, 3, 5, 6]);
});
